gianbartadougall/WatchDog-ESP32/STM32/Core/Src/watchdog.c
    char i = 'A';
    while (1) {

        if (i == 0) {
            i = 1;
            wd_write_bpacket_esp(&bpk1);
            log_usb_message("led on\r\n");
        } else {
            i = 0;
            log_usb_message("led off\r\n");
            wd_write_bpacket_esp(&bpk2);
        }

        if (uart_read_bpacket(0, &bpk3) == TRUE) {
            log_usb_success("Rec: %i Send: %i Request: %i Code: %i Len: %i\r\n", bpk3.Receiver.val, bpk3.Sender.val,
                            bpk3.Request.val, bpk3.Code.val, bpk3.Data.numBytes);

            if (bpk3.Code.val != BPK_CODE_SUCCESS) {
                // Print the msg
                for (int i = 0; i < bpk3.Data.numBytes; i++) {
                    log_usb_error("%c", bpk3.Data.bytes[i]);
                }
                log_usb_message("\r\n");
            }

            wd_handle_esp_response(&bpk3);
        }

        // if (usb_read_packet(&bpk2) == TRUE) {
        //     if (bpk2.Request.val == BPK_REQUEST_PING) {
        //         // Create response
        //         static uint8_t stmPingCode = 47;
        //         if (bpk_create(&bpk3, BPK_Addr_Receive_Maple, BPK_Addr_Send_Stm32, BPK_Request_Ping,
        //         BPK_Code_Success,
        //                        1, &stmPingCode) != TRUE) {
        //             wd_error_handler(__FILE__, __LINE__);
        //             break;
        //         }

        //         // Send bpacket to Maple
        //         wd_write_bpacket_maple(&bpk3);
        //     }
        // }

        HAL_Delay(5000);
    }

    ds18b20_init();

    /* Initialise software */
    // TODO: Change the task scheduler timer. TIM15 is used for the ds18b20 so it cannot
    // be used for the task scheduler. Will need to find a different one. Reenable timer
    // in hardware config.c as I commented it out
    // task_scheduler_init(); // Reset Recipes list

    if (rtc_init() != TRUE) {
        wd_error_handler(__FILE__, __LINE__);
    }

    // Read the watchdog settings from flash
    wd_read_settings(&gbl_CaptureTime, &lg_CameraSettings);

    // Initialise event groups
    event_group_clear(&gbl_EventsStm);
    event_group_clear(&gbl_EventsEsp);

    // TODO: Confirm the start, end and interval times just read are valid

    // TODO: Calcaulte when the next alarm should be and set the RTC alarm for that

    // TODO: Confirm the camera settings are valid

    // Set flag 'take photo' flag. In main loop below, STM32 will request ESP to
    // take a photo if this flag has been set. Getting ESP32 to take a photo on
    // startup to ensure the system is working correctly
    event_group_set_bit(&gbl_EventsEsp, EVENT_ESP_TAKE_PHOTO, EGT_ACTIVE);

    // Set flag 'system initialising' flag. In main loop where stm32 waits for
    // responses back from the ESP, if it gets a response saying a photo was taken
    // and the system init flag has been set then it knows that the photo was a test
    // photo as this flag is only set once on startup. The STM32 can then blink an
    // led to let the user know that the system has been initialised
    event_group_set_bit(&gbl_EventsStm, EVENT_STM_SYSTEM_INITIALISING, EGT_ACTIVE);

    // Enter main loop
    bpk_t BpkEspResponse, MapleBpacket;
    uint8_t lastRTCSecond = 0;

    while (1) {

        /* Turn the ESP on or off depending on if there are esp tasks that need to occur */

        // Check if there are any esp flags that are set that are not ESP_ON or ESP_READY
        if ((event_group_get_bits(&gbl_EventsEsp, EGT_ACTIVE) &
             ~((0x01 << EVENT_ESP_ON) | (0x01 << EVENT_ESP_READY))) != 0) {

            // There is an esp event that needs to occur. Ensure the ESP has been turned on
            if (event_group_poll_bit(&gbl_EventsEsp, EVENT_ESP_ON, EGT_ACTIVE) != TRUE) {
                wd_esp_turn_on();
            }
        } else {

            // There are no pending esp events. Turn the ESP off if it is not already off
            if (event_group_poll_bit(&gbl_EventsEsp, EVENT_ESP_ON, EGT_ACTIVE) == TRUE) {
                wd_esp_turn_off();
            }
        }

        /* Put the STM32 to sleep if required */
        if (event_group_poll_bit(&gbl_EventsStm, EVENT_STM_SLEEP, EGT_ACTIVE) == TRUE) {
            event_group_clear_bit(&gbl_EventsStm, EVENT_STM_SLEEP, EGT_ACTIVE);

            // TODO: Put the STM32 to sleep
        }

        /* Request ESP32 to take a photo if the 'take photo' flag has been set */
        if ((event_group_poll_bit(&gbl_EventsEsp, EVENT_ESP_TAKE_PHOTO, EGT_ACTIVE) == TRUE) &&
            (event_group_poll_bit(&gbl_EventsEsp, EVENT_ESP_TAKE_PHOTO, EGT_EVENT_RUNNING) == FALSE)) {

            // Set the event running trait to signify this event is currently running
            event_group_set_bit(&gbl_EventsEsp, EVENT_ESP_TAKE_PHOTO, EGT_EVENT_RUNNING);

            // Don't request a photo until the ESP is in the ready state. The ESP takes
            // a second or two to startup after it has been turned on. The ESP_READY flag
            // will be set automatically by the STM when the ESP is ready to receive commands
            if (event_group_poll_bit(&gbl_EventsEsp, EVENT_ESP_READY, EGT_ACTIVE) == TRUE) {
                event_group_clear_bit(&gbl_EventsEsp, EVENT_ESP_TAKE_PHOTO, EGT_ACTIVE);

                uint8_t errorCode[1];
                if (wd_request_photo_capture(errorCode) != TRUE) {
                    wd_error_handler_2("Error %s on line %i. Code %i\r\n", __FILE__, __LINE__, errorCode[0]);
                }

                /****** START CODE BLOCK ******/
                // Description: Debugging. Can delete when not needed
                dt_datetime_t Dt;
                if (rtc_read_datetime(&Dt) != TRUE) {
                    wd_error_handler(__FILE__, __LINE__);
                }

                log_usb_success("Photo Requested [%i:%i:%i %i/%i/%i]\r\n", Dt.Time.hour, Dt.Time.minute, Dt.Time.second,
                                Dt.Date.day, Dt.Date.month, Dt.Date.year);
                /****** END CODE BLOCK ******/
            }
        }

