gianbartadougall/WatchDog-ESP32/STM32/Core/Src/watchdog.c
        /* Check whether the RTC alarm needs to be updated. This flag is set in the ISR that is triggered
            whenever the alarm time in the RTC matches the RTC time */
        if (event_group_poll_bit(&gbl_EventsStm, EVENT_STM_RTC_UPDATE_ALARM, EGT_ACTIVE) == TRUE) {
            event_group_clear_bit(&gbl_EventsStm, EVENT_STM_RTC_UPDATE_ALARM, EGT_ACTIVE);

            /* Calculate the next alarm time */
            dt_datetime_t AlarmTime;
            if (rtc_read_alarm_datetime(&AlarmTime) != TRUE) {
                wd_error_handler(__FILE__, __LINE__);
            }

            dt_datetime_add_time(&AlarmTime, gbl_CaptureTime.intervalSecond, gbl_CaptureTime.intervalMinute,
                                 gbl_CaptureTime.intervalHour, gbl_CaptureTime.intervalDay);

            // Check if the system still needs to take photos
            if (dt1_greater_than_dt2(&AlarmTime, &gbl_CaptureTime.Start) == TRUE) {
                rtc_disable_alarm();
            } else {
                rtc_set_alarm(&AlarmTime);
            }
        }

        /* Process all packets received from the ESP32 */
        if (uart_read_bpacket(0, &BpkEspResponse) == TRUE) {
            wd_handle_esp_response(&BpkEspResponse);
        }

        // TODO: Process the button being pressed

        // Polling the USBC connection pin. The reason it is being polled instead of having an
        // interrupt is because if the system is not powered by batteries and only powered by
        // a USB C connector, the pin will go high before the circuit starts running in which
        // case the interrupt would never fire. Polling ensures that no matter how the system
        // is powered, it will always know if the USBC is connected or not
        if (GPIO_PIN_IS_HIGH(USBC_CONN_PORT, USBC_CONN_PIN)) {
            GPIO_SET_HIGH(LED_GREEN_PORT, LED_GREEN_PIN);

            // USBC is connected, check for any incoming bpackets and process them if any come
            if (usb_read_packet(&MapleBpacket) == TRUE) {
                wd_handle_maple_request(&MapleBpacket);
            }

            /* Send the datetime to the computer to display on GUI */
            dt_datetime_t dt;
            if (rtc_read_datetime(&dt) != TRUE) {
                wd_error_handler(__FILE__, __LINE__);
            }

            if (lastRTCSecond != dt.Time.second) {
                lastRTCSecond = dt.Time.second;

                uint8_t datetimeData[7] = {
                    dt.Time.second, dt.Time.minute,    dt.Time.hour,        dt.Date.day,
                    dt.Date.month,  dt.Date.year >> 8, dt.Date.year & 0xFF,
                };

                bpk_t BpkDatetime;
                bpk_create(&BpkDatetime, BPK_Addr_Receive_Maple, BPK_Addr_Send_Stm32, BPK_Req_Get_Datetime,
                           BPK_Code_Success, 7, datetimeData);

                wd_write_bpacket_maple(&BpkDatetime);
            }

        } else {
            GPIO_SET_LOW(LED_GREEN_PORT, LED_GREEN_PIN);
        }

        // TODO: Check whether the STM32 needs to go to sleep
    }
}

void wd_handle_maple_request(bpk_t* Bpacket) {

    // Create a bpacket to store the response to send back to Maple
    static bpk_t BpkStmResponse;

    switch (Bpacket->Request.val) {

        case BPK_REQUEST_PING:;

            // Create response
            static uint8_t stmPingCode = 47;
            if (bpk_create(&BpkStmResponse, BPK_Addr_Receive_Maple, BPK_Addr_Send_Stm32, BPK_Request_Ping,
                           BPK_Code_Success, 1, &stmPingCode) != TRUE) {
                wd_error_handler(__FILE__, __LINE__);
                break;
            }

            // Send bpacket to Maple
            wd_write_bpacket_maple(&BpkStmResponse);

            break;

        case BPK_REQ_TAKE_PHOTO:;

            event_group_set_bit(&gbl_EventsEsp, EVENT_ESP_TAKE_PHOTO, EGT_ACTIVE);
            event_group_clear_bit(&gbl_EventsEsp, EVENT_ESP_TAKE_PHOTO, EGT_STM_REQUEST);
            event_group_clear_bit(&gbl_EventsEsp, EVENT_ESP_TAKE_PHOTO, EGT_EVENT_RUNNING);

            // uint8_t errorCode[1];
            // if (wd_request_photo_capture(errorCode) != TRUE) {

            //     // Check whether the take photo request was from the stm32 or maple
            //     if (event_group_poll_bit(&gbl_EventsEsp, EVENT_ESP_TAKE_PHOTO, EGT_STM_REQUEST) != TRUE) {
            //         bpk_create(&BpkStmResponse, BPK_Addr_Receive_Maple, BPK_Addr_Send_Stm32, BPK_Req_Take_Photo,
            //                    BPK_Code_Error, 1, errorCode);
            //         wd_write_bpacket_maple(&BpkStmResponse);

            //         // Clear event group bits
            //         event_group_clear_bit(&gbl_EventsEsp, EVENT_ESP_TAKE_PHOTO, EGT_ACTIVE);
            //         event_group_clear_bit(&gbl_EventsEsp, EVENT_ESP_TAKE_PHOTO, EGT_STM_REQUEST);
            //         event_group_clear_bit(&gbl_EventsEsp, EVENT_ESP_TAKE_PHOTO, EGT_EVENT_RUNNING);

            //         break;
            //     }

            //     wd_error_handler(__FILE__, __LINE__);
            // }

            // // Set the event running trait to signify this event is currently running
            // event_group_set_bit(&gbl_EventsEsp, EVENT_ESP_TAKE_PHOTO, EGT_EVENT_RUNNING);

            // // Clear the stm request trait to signify that stm did not trigger this event
            // event_group_clear_bit(&gbl_EventsEsp, EVENT_ESP_TAKE_PHOTO, EGT_STM_REQUEST);

            break;

        case BPK_REQ_SET_DATETIME:;

            // Extract the datetime
            dt_datetime_t Datetime;
            if (dt_datetime_init(&Datetime, Bpacket->Data.bytes[0], Bpacket->Data.bytes[1], Bpacket->Data.bytes[2],
                                 Bpacket->Data.bytes[3], Bpacket->Data.bytes[4],
                                 (((uint16_t)Bpacket->Data.bytes[5]) << 8) | Bpacket->Data.bytes[6]) != TRUE) {
                // TODO: Handle error
                break;
            }

            /* Update the RTC with the new datetime */
            if (rtc_write_datetime(&Datetime) != TRUE) {
                // TODO: Handle the error

                break;
            }

            bpk_create(&BpkStmResponse, BPK_Addr_Receive_Maple, BPK_Addr_Send_Stm32, BPK_Req_Set_Datetime,
                       BPK_Code_Success, 0, NULL);
            wd_write_bpacket_maple(&BpkStmResponse);
            break;

        case BPK_REQ_SET_WATCHDOG_SETTINGS:;

            /* Extract the settings from the bpacket and convert them to structs */
            capture_time_t NewCaptureTimeSettings;
            camera_settings_t NewCamSettings;
            wd_utils_bpk_to_settings(Bpacket, &NewCaptureTimeSettings, &NewCamSettings);

            /* Write new settings to flash */
            if (wd_write_settings(&NewCaptureTimeSettings, &NewCamSettings) != TRUE) {
                wd_error_handler(__FILE__, __LINE__);
            }

            // Update the camera settings structs by reading the flash
            wd_read_settings(&gbl_CaptureTime, &lg_CameraSettings);

            /* Send success response */
            bpk_create(&BpkStmResponse, BPK_Addr_Receive_Maple, BPK_Addr_Send_Stm32, BPK_Req_Set_Watchdog_Settings,
                       BPK_Code_Success, 0, NULL);
            wd_write_bpacket_maple(&BpkStmResponse);

            break;

