gianbartadougall/WatchDog-ESP32/STM32/Core/Src/watchdog.c
        case BPK_REQ_GET_WATCHDOG_SETTINGS:;

            /* Store current watchdog settings into bpacket and send to computer */
            uint8_t settingsData[19];
            wd_utils_settings_to_array(settingsData, &gbl_CaptureTime, &lg_CameraSettings);

            /* Create bpacket and send to computer */
            bpk_create(&BpkStmResponse, BPK_Addr_Receive_Maple, BPK_Addr_Send_Stm32, BPK_Req_Get_Watchdog_Settings,
                       BPK_Code_Success, 19, settingsData);
            wd_write_bpacket_maple(&BpkStmResponse);

            break;

        case BPK_REQ_GET_TEMPERATURE:;

            if (ds18b20_read_temperature(&Ds18b20) != TRUE) {
                wd_error_handler(__FILE__, __LINE__);
            }

            uint8_t tempData[sizeof(float)];
            float_to_u8(tempData, Ds18b20.temp);
            bpk_create(&BpkStmResponse, BPK_Addr_Receive_Maple, BPK_Addr_Send_Stm32, BPK_Req_Get_Temperature,
                       BPK_Code_Success, sizeof(float), tempData);
            wd_write_bpacket_maple(&BpkStmResponse);

            break;

        default:
            wd_error_handler_2("Error %s on line %i. Unexpected request %i\r\n", __FILE__, __LINE__,
                               Bpacket->Request.val);
    }

    // TODO: implement
}

void wd_write_bpacket_maple(bpk_t* Bpacket) {
    static bpk_buffer_t Buffer;
    bpk_to_buffer(Bpacket, &Buffer);
    log_usb_bytes(Buffer.buffer, Buffer.numBytes);
}

void wd_write_bpacket_esp(bpk_t* Bpacket) {
    static bpk_buffer_t Buffer;
    bpk_to_buffer(Bpacket, &Buffer);
    uart_transmit_data(UART_ESP32, Buffer.buffer, Buffer.numBytes);
}

void wd_handle_esp_response(bpk_t* Bpacket) {

    bpk_t BpkStmResponse;

    if (Bpacket->Request.val == BPK_REQUEST_PING) {

        /* Clear timeout */

        // Ping from ESP received => ESP ready to take requests
        event_group_set_bit(&gbl_EventsEsp, EVENT_ESP_READY, EGT_ACTIVE);

        log_usb_message("Received ESP ping!\r\n");
    }

    if (Bpacket->Request.val == BPK_REQ_TAKE_PHOTO) {

        /* TODO: Clear timeout */

        // Determine whether the STM triggered the request or not
        if (event_group_poll_bit(&gbl_EventsEsp, EVENT_ESP_TAKE_PHOTO, EGT_STM_REQUEST) == FALSE) {

            if (Bpacket->Code.val != BPK_CODE_SUCCESS) {
                bpk_create(&BpkStmResponse, BPK_Addr_Receive_Maple, BPK_Addr_Send_Stm32, BPK_Req_Take_Photo,
                           BPK_Code_Error, 0, NULL);
            } else {
                bpk_create(&BpkStmResponse, BPK_Addr_Receive_Maple, BPK_Addr_Send_Stm32, BPK_Req_Take_Photo,
                           BPK_Code_Success, 0, NULL);
            }

            wd_write_bpacket_maple(&BpkStmResponse);
            return;
        }

        if (Bpacket->Code.val != BPK_CODE_SUCCESS) {
            wd_error_handler(__FILE__, __LINE__);
        }

        log_usb_message("Took a photo\r\n!");

        return;
    }
}

void wd_error_handler(char* fileName, uint16_t lineNumber) {

    // TODO: Turn the ESP off

    while (1) {

        HAL_Delay(1000);
        GPIO_TOGGLE(LED_RED_PORT, LED_RED_PIN);

        log_usb_error("Error code in %s on line %i\r\n", fileName, lineNumber);
    }
}

uint8_t wd_request_photo_capture(uint8_t errorCode[1]) {

    bpk_t BpkStmResponse;

    if (ds18b20_read_temperature(&Ds18b20) != TRUE) {
        errorCode[0] = bpkErrRecordTemp[0];
        return FALSE;
    }

    dt_datetime_t Datetime;
    if (rtc_read_datetime(&Datetime) != TRUE) {
        errorCode[0] = bpkErrReadDatetime[0];
        return FALSE;
    }

    /* Store temperature and datetime into bpacket and send request to the ESP */
    uint8_t data[sizeof(dt_datetime_t) + sizeof(float)];
    wd_utils_photo_data_to_array(data, &Datetime, Ds18b20.temp);

    bpk_t BpkTakePhoto;
    bpk_create(&BpkTakePhoto, BPK_Addr_Receive_Esp32, BPK_Addr_Send_Stm32, BPK_Req_Take_Photo, BPK_Code_Execute,
               sizeof(dt_datetime_t) + sizeof(float), data);
    wd_write_bpacket_esp(&BpkTakePhoto);

    /* TODO: Implement timeout */

    return TRUE;
}

uint8_t wd_write_settings(capture_time_t* CaptureTime, camera_settings_t* CameraSettings) {

    uint32_t* startAddress = (uint32_t*)WD_FLASH_SETTINGS_START_ADDRESS;

    // Loop through each address and look for the first 2 32 bit address that have no data
    // in them
    while ((*startAddress != 0xFFFFFFFF) || ((*(startAddress + 1)) != 0xFFFFFFFF)) {
        // Increment by 2 because flash is comprised of 64 bit values
        startAddress += 2;
    }

    // Compact capture time data into a uin64_t array. This is required because only 64 bit
    // data can be written to the flash
    uint64_t settingsData[4] = {
        (((uint64_t)CaptureTime->Start.Time.second) << 56) | (((uint64_t)CaptureTime->Start.Time.minute) << 48) |
            (((uint64_t)CaptureTime->Start.Time.hour) << 40) | (((uint64_t)CaptureTime->Start.Date.day) << 32) |
            (((uint64_t)CaptureTime->Start.Date.month) << 24) | (((uint64_t)CaptureTime->Start.Date.year) << 8),
        (((uint64_t)CaptureTime->End.Time.second) << 56) | (((uint64_t)CaptureTime->End.Time.minute) << 48) |
            (((uint64_t)CaptureTime->End.Time.hour) << 40) | (((uint64_t)CaptureTime->End.Date.day) << 32) |
            (((uint64_t)CaptureTime->End.Date.month) << 24) | (((uint64_t)CaptureTime->End.Date.year) << 8),
        (((uint64_t)CaptureTime->intervalSecond) << 48) | (((uint64_t)CaptureTime->intervalMinute) << 32) |
            (((uint64_t)CaptureTime->intervalHour) << 16) | (((uint64_t)CaptureTime->intervalSecond) << 0),
        ((uint64_t)0xFFFFFFFF << 32) | (((uint64_t)CameraSettings->resolution) << 24) | 0x00FFFFFF,
    };

    // Check whether data has already been written to the page or not
    if (startAddress >= (uint32_t*)(WD_FLASH_SETTINGS_START_ADDRESS + (8 * 4))) {
        // Assume that the data needs to be written
        uint8_t writeRequired = FALSE;

        // Compare the data to write with the last bit of data that was written and see if they
        // are the same
        for (uint8_t i = 0; i < 4; i++) {

            uint64_t upperBytes = (uint64_t) * (startAddress - (8 - (i * 2))) << 32;
            uint32_t lowerBytes = (uint64_t) * (startAddress - (7 - (i * 2)));

