gianbartadougall/WatchDog-ESP32/STM32/Core/Src/watchdog.c
            if (settingsData[i] != (upperBytes | lowerBytes)) {
                writeRequired = TRUE;
                break;
            }
        }

        if (writeRequired == FALSE) {
            return TRUE;
        }

        // Check whether the 32 bit address is at an odd or even address. If the
        // address is currently odd then we need to increment one to make it even
        // that way a full 64 bit value can be written to it otherwise writing to
        // the flash will fail when doing so with an odd address
        if (((((uint32_t)startAddress) / 4) % 2) != 0) {
            startAddress++;
        }

        // Calculate the correct address for the new data
        if ((startAddress + 8) > (uint32_t*)WD_FLASH_SETTINGS_END_ADDRESS) {

            startAddress = (uint32_t*)WD_FLASH_SETTINGS_START_ADDRESS;

            /* Erase the page to start again */
            if (HAL_FLASH_Unlock() != HAL_OK) {
                wd_error_handler(__FILE__, __LINE__);
            }

            FLASH_EraseInitTypeDef eraseConfig;
            eraseConfig.TypeErase = FLASH_TYPEERASE_PAGES;
            eraseConfig.Page      = 127;
            eraseConfig.NbPages   = 1; // Number of pages to be erased

            uint32_t pageError = 0;
            if (HAL_FLASHEx_Erase(&eraseConfig, &pageError) != HAL_OK) {
                wd_error_handler(__FILE__, __LINE__);
            }

            if (HAL_FLASH_Lock() != HAL_OK) {
                wd_error_handler(__FILE__, __LINE__);
            }
        }
    }

    /* Write data to memory */
    if (HAL_FLASH_Unlock() != HAL_OK) {
        wd_error_handler(__FILE__, __LINE__);
    }

    for (uint8_t i = 0; i < 4; i++) {
        if (HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD, (uint32_t)startAddress, settingsData[i]) != HAL_OK) {
            wd_error_handler(__FILE__, __LINE__);
        }

        // Increment by 2 because we just wrote two 32 bit values to the flash
        startAddress += 2;
    }

    if (HAL_FLASH_Lock() != HAL_OK) {
        wd_error_handler(__FILE__, __LINE__);
    }

    return TRUE;
}

void wd_read_settings(capture_time_t* CaptureTime, camera_settings_t* CameraSettings) {

    uint32_t* startAddress = (uint32_t*)WD_FLASH_SETTINGS_START_ADDRESS;

    while ((*startAddress != 0xFFFFFFFF) || ((*(startAddress + 1)) != 0xFFFFFFFF)) {
        startAddress += 2;
    }

    // If there are no settings currently set, startAddress will not have incremented
    if (startAddress == (uint32_t*)WD_FLASH_SETTINGS_START_ADDRESS) {

        /* Set the default settings such that system will take a photo twice a day */
        CaptureTime->Start.Date.day    = 1;
        CaptureTime->Start.Date.month  = 1;
        CaptureTime->Start.Date.year   = 2023;
        CaptureTime->Start.Time.second = 0;
        CaptureTime->Start.Time.minute = 0;
        CaptureTime->Start.Time.hour   = 0;

        CaptureTime->End.Date.day    = 1;
        CaptureTime->End.Date.month  = 1;
        CaptureTime->End.Date.year   = 2030;
        CaptureTime->End.Time.second = 0;
        CaptureTime->End.Time.minute = 0;
        CaptureTime->End.Time.hour   = 0;

        CaptureTime->intervalSecond = 0;
        CaptureTime->intervalMinute = 0;
        CaptureTime->intervalHour   = 2;
        CaptureTime->intervalDay    = 0;

        CameraSettings->resolution = 5;

        /* These are now the default settings. Write them to the flash */
        if (wd_write_settings(CaptureTime, CameraSettings) != TRUE) {
            wd_error_handler(__FILE__, __LINE__);
        }

        return;
    }

    // Data to read in the settings. The startAddress is pointing to the address after the
    // last bit of data. Need to go back 8 addresses
    startAddress -= 8;

    // Read data into buffer
    uint64_t flashRead[4];
    for (uint8_t i = 0; i < 4; i++) {

        // The way the flash is written in memory you need to read it out like this
        flashRead[i] = (((uint64_t)(*(startAddress + 1))) << 32) | ((uint64_t)(*startAddress));

        // Increment by 2 as we are reading 64 bits at a time
        startAddress += 2;
    }

    // Copy buffer across to structs
    CaptureTime->Start.Time.second = (uint8_t)((flashRead[0] >> 56) & 0xFF);
    CaptureTime->Start.Time.minute = (uint8_t)((flashRead[0] >> 48) & 0xFF);
    CaptureTime->Start.Time.hour   = (uint8_t)((flashRead[0] >> 40) & 0xFF);
    CaptureTime->Start.Date.day    = (uint8_t)((flashRead[0] >> 32) & 0xFF);
    CaptureTime->Start.Date.month  = (uint8_t)((flashRead[0] >> 24) & 0xFF);
    CaptureTime->Start.Date.year   = (uint16_t)((flashRead[0] >> 8) & 0xFFFF);

    CaptureTime->End.Time.second = (uint8_t)((flashRead[1] >> 56) & 0xFF);
    CaptureTime->End.Time.minute = (uint8_t)((flashRead[1] >> 48) & 0xFF);
    CaptureTime->End.Time.hour   = (uint8_t)((flashRead[1] >> 40) & 0xFF);
    CaptureTime->End.Date.day    = (uint8_t)((flashRead[1] >> 32) & 0xFF);
    CaptureTime->End.Date.month  = (uint8_t)((flashRead[1] >> 24) & 0xFF);
    CaptureTime->End.Date.year   = (uint16_t)((flashRead[1] >> 8) & 0xFFFF);

    CaptureTime->intervalSecond = (uint16_t)(flashRead[2] >> 48);
    CaptureTime->intervalMinute = (uint16_t)((flashRead[2] >> 32) & 0xFFFF);
    CaptureTime->intervalHour   = (uint16_t)((flashRead[2] >> 16) & 0xFFFF);
    CaptureTime->intervalDay    = (uint16_t)(flashRead[2] & 0xFFFF);

    CameraSettings->resolution = (uint8_t)((flashRead[3] >> 24) & 0xFF);
}